############################################################
#
# 編集画面に添付ファイルフォームを表示するプラグイン
#
############################################################
package plugin::attach::AttachForm;
use strict;
#==========================================================
# コンストラクタ
#==========================================================
sub new {
	my $class = shift;
	my $self  = {};
	return bless($self,$class);
}

#==========================================================
# 添付フォームを表示
#==========================================================
sub editform {
	my $self = shift;
	my $wiki = shift;
	
	# ページが存在する場合だけフォームを表示
	if($wiki->page_exists($wiki->get_CGI()->param("page"))){
		return "<h2>添付ファイル</h2>\n".
		       "<p>".$wiki->process_wiki("{{files}}")."</p>\n".
		       $wiki->process_wiki("{{attach}}");
	}
}

1;
