###############################################################################
#
# FSWikiの書式をサポートするフォーマットプラグイン
# 他の書式とインターフェースをあわせるためのクラスで、実際に変換は行いません。
#
###############################################################################
package plugin::format::FSWikiFormat;
use strict;
#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self  = {};
	return bless $self,$class;
}

#==============================================================================
# FSWikiの書式に変換します（無変換）。
#==============================================================================
sub convert_to_fswiki {
	my $self   = shift;
	my $source = shift;
	return $source;
}

#==============================================================================
# FSWikiの書式に変換します（無変換）。
#==============================================================================
sub convert_from_fswiki {
	my $self   = shift;
	my $source = shift;
	return $source;
}

#==============================================================================
# インライン書式をFSWikiの書式に変換します（無変換）。
#==============================================================================
sub convert_to_fswiki_line {
	my $self = shift;
	my $source = shift;
	return $source;
}

#==============================================================================
# インライン書式をFSWikiの書式に変換します（無変換）。
#==============================================================================
sub convert_from_fswiki_line {
	my $self = shift;
	my $source = shift;
	return $source;
}

1;
