###############################################################################
#
# <p>表示中のページを編集するためのアンカを出力します。</p>
# <pre>
# {{edit}}
# </pre>
# <p>
#   サイドメニューやヘッダ、フッタの場合は上記の記述だと
#   表示中のページの編集になってしまうので明示的にページ名を指定します。
# </p>
# <pre>
# {{edit Menu}}
# </pre>
#
###############################################################################
package plugin::core::Edit;
#use strict;
#==============================================================================
# コンストラクタ
#==============================================================================
sub new {
	my $class = shift;
	my $self = {};
	return bless $self,$class;
}

#==============================================================================
# インラインメソッド
#==============================================================================
sub inline {
	my $self = shift;
	my $wiki = shift;
	my $page = shift;
	
	if($page eq ""){
		$page = $wiki->get_CGI->param("page");
	}
	
	if($wiki->can_modify_page($page)){
		return "[<a href=\"".$wiki->create_url( { action=>"EDIT", page=>$page } )."\">edit</a>]";
	} else {
		return "";
	}
}

1;
